ERP_DZGU_EXTENTION/Documents/БИТ_ВозвратВКарантин.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>БИТ_ВозвратВКарантин</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БИТ_Карантин</xr:Item>
				<xr:Item>InformationRegister.БИТ_СтатусыСертификаций</xr:Item>
				<xr:Item>AccumulationRegister.БИТ_СертификацияОстатки</xr:Item>
				<xr:Item>AccumulationRegister.БИТ_ОтказСертификации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСертификации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СерииНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERP_DZGU_EXTENTION/Documents/БИТ_ВозвратВКарантин/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция  ЗаполнитьСтроку(Сертификат)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
    |   БИТ_СертификацияНоменклатуры.Количество КАК Количество,
    |   БИТ_СертификацияНоменклатуры.Номенклатура КАК Номенклатура,
    |   БИТ_СертификацияНоменклатуры.Серия КАК Серия,
    |   БИТ_СертификацияНоменклатуры.Склад КАК Склад
    |ИЗ
    |   Документ.БИТ_СертификацияНоменклатуры КАК БИТ_СертификацияНоменклатуры
    |ГДЕ
    |   БИТ_СертификацияНоменклатуры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Сертификат);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ДанныеСтр = Новый Структура;
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДанныеСтр.Вставить("Количество",ВыборкаДетальныеЗаписи.Количество);
		ДанныеСтр.Вставить("Номенклатура",ВыборкаДетальныеЗаписи.Номенклатура);
		ДанныеСтр.Вставить("Серия",ВыборкаДетальныеЗаписи.Серия);
		ДанныеСтр.Вставить("Склад",ВыборкаДетальныеЗаписи.Склад);
	КонецЕсли;
	Возврат ДанныеСтр;
КонецФункции
&НаКлиенте
Процедура СерииНоменклатурыСертификатПриИзменении(Элемент)
	ТекСтр = Элементы.СерииНоменклатуры.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтр.Сертификат) Тогда
		ДанныеСтроки = ЗаполнитьСтроку(ТекСтр.Сертификат); 
		ТекСтр.Количество = ДанныеСтроки.Количество;
		ТекСтр.Номенклатура = ДанныеСтроки.Номенклатура;
		ТекСтр.Серия  = ДанныеСтроки.Серия;
        ТекСтр.Склад  = ДанныеСтроки.Склад;
	Иначе
		ТекСтр.Количество = 0;
	КонецЕсли;
КонецПроцедуры
